Repository: wp-plugins/em-object-cache
Catalog: lang/emobjectcache-*.po
Languages: ru_ru

source: Generic Options
ru_ru: Общие настройки

source: %1$s Options
ru_ru: Настройки %1$s

source: APC Caching Engine Options
ru_ru: Настройки кэширующего модуля APC

source: Prefix (must be unique for every site)
ru_ru: Префикс (должен быть уникальным для каждого сайта)

source: Default value is <code>%1$s</code>
ru_ru: Значение по умолчанию: <code>%1$s</code>

source: Save Changes
ru_ru: Сохранить изменения

source: eAccelerator Caching Engine Options
ru_ru: Настройки кэширующего модуля eAccelerator

source: FileCache Caching Engine Options
ru_ru: Настройки кэширующего модуля FileCache

source: Cache path
ru_ru: Путь к кэшу

source: If at all possible, try to place the cache to a RAM drive (or <code>/dev/shm</code> in Linux).
ru_ru: Если имеется возможность, расположите кэш на RAM-диске (или <code>/dev/shm</code> в Linux).

source: For security reasons the cache should be located outside the web root and be inaccessible from the web.
ru_ru: В целях безопасности кэш должен располагаться вне корня сайта и быть недоступным из web

source: It is extremely important that the cache directory <strong>be writable by the server</strong>!
ru_ru: Очень важно, чтобы web-сервер <strong>имел права на запись</strong> в каталог с кэшем

source: Memcached Caching Engine Options
ru_ru: Настройки кэширующего модуля Memcached

source: Memcached server
ru_ru: Сервер Memcached

source: Host:
ru_ru: Хост:

source: Port:
ru_ru: Порт:

source: Weight:
ru_ru: Приоритет:

source: Add
ru_ru: Добавить

source: To delete a server, clear the <code>Host</code> field.
ru_ru: Чтобы удалить сервер, очистите поле <code>Хост</code>.

source: Memcache Caching Engine Options
ru_ru: Настройки кэширующего модуля Memcache

source: You can use UNIX socket instead of the host name; in this case please set the port to 0.
ru_ru: Вместо имени хоста Вы можете задать UNIX-сокет; в этом случае установите, пожалуйста, порт в 0

source: Enable WordPress Object Cache
ru_ru: Включить объектный кэш WordPress

source: Disabling WordPress Object Cache can make WordPress crawl!
ru_ru: Отключение объектного кэша WordPress может привести к сильному замедлению работы WordPress!

source: If you disable WordPress Object Cache, caching will be completely disabled, and WordPress will have to use the database every time it needs data. This is really slow.
ru_ru: Если Вы отключите объектный кэш WordPress, кэширование будет полностью выключено, и WordPress будет обращаться к базе данных каждый раз, когда ему нужны данные. Это будет невероятно медленно.

source: This can be useful only if you are a WordPress developer.
ru_ru: Данная опция полезна только разработчикам WordPress.

source: Save cached data across sessions
ru_ru: Сохранять кэш между сессиями

source: If this option is set, EM Object Cache will maintain its cache between sessions to improve overall performance. Actually, this is what this plugin was made for and we strongly recommend that you do not turn this option off.
ru_ru: Если данная опция включена, EM Object Cache будет сохранять кэш между сессиями, что позволит улучшить производительность. Собственно, это то, ради чего данный плагин и был написан. Поэтому мы не рекомендуем отключать данную опцию.

source: <strong>Boring technical details:</strong> EM Object Cache will save only those data that were not marked as 'non-persistent'.
ru_ru: <strong>Скучные технические детали:</strong> данные, помеченные как &quot;несохраняемые&quot; сохраняться не будут. Что вполне логично.

source: Cache engine
ru_ru: Кэширующий модуль

source: Non-persistent groups
ru_ru: Несохраняемые группы

source: Comma separated list of the cache groups which should never be stored across sessions.
ru_ru: Список групп, разделённых запятыми, которые не должны сохраняться между сессиями.

source: Maximum TTL
ru_ru: Максимальное время жизни

source: <code>0</code> is engine dependent and not recommended unless you have much memory allocated for the cache.
ru_ru: Поведение при нулевом значении зависит от кэширующего модуля и в общем случае не рекомендуется, если Вы не выделили большое количество памяти под кэш.

source: Purge Cache
ru_ru: Очистить кэш

source: Are you sure?
ru_ru: Вы уверены?

source: xCache Caching Engine Options
ru_ru: Настройки кэширующего модуля xCache

source: ZDC Caching Engine Options
ru_ru: Настройки кэширующего модуля ZDC

source: Namespace (must be unique for every site)
ru_ru: Пространство имён (должно быть уникально для каждого сайта)

source: ZSC Caching Engine Options
ru_ru: Настройки кэширующего модуля ZSC

source: The settings have been updated.
ru_ru: Настройки обновлены.

source: Unable to write to <code>%1$s</code>. Please make sure that it is writable by the server.
ru_ru: Невозможно записать данные в файл <code>%1$s</code>. Убедитесь, что PHP иммет необходимые права на запись в файл.

source: The cache has been cleared.
ru_ru: Кэш очищен.
